## ■ 머신러닝을 이용한 데이터 분석 코드의 큰 흐름

1. __데이터 전처리 코드 :__ pandas 를 사용

2. __시각화 :__ matplotlib, seaborn 을 사용

3. __머신러닝을 이용한 모델 생성 및 분석 :__ sklearn을 사용

4. __모델의 성능 검증 :__ Pandas를 사용

5. __모델의 성능을 높이는 방법 :__ Pandas를 사용 & 파생변수를 생성

## ■ 판다스 자료 구조

### 2.1 판다스의 Series에 대한 이해

__시리즈(series)__는 데이터가 순차적으로 나열된 __1차원 배열__의 형태를 갖는다. 파이썬 기본 내장 자료구조인 딕셔너리와 비슷한 구조를 갖고 있다.

### ※ 파이썬 딕셔너리 자료구조

index0 ---> data0  
index1 ---> data1  
index2 ---> data2  
###  :  
indexn ---> datan  

Index : 데이터의 주소  
datan : 데이터의 값  

위와 같이 시리즈 또한 인덱스와 데이터의 값으로 구성되어 있다.

| 오라클 |   판다스   |
|:------:|:----------:|
| 테이블 | data frame |
|  칼럼  |   Series   |

In [2]:
# 예제

import pandas as pd
dict_data = {'a':1, 'b':2, 'c':3}
sr = pd.Series(dict_data) # 딕셔너리를 시리즈로 변환
print(sr) 
print(type(sr))

"""
a    1
b    2
c    3
dtype: int64
<class 'pandas.core.series.Series'>

a,b,c --> 인덱스
1,2,3 --> 데이터 값

"""

a    1
b    2
c    3
dtype: int64
<class 'pandas.core.series.Series'>

"\na    1\nb    2\nc    3\ndtype: int64\n<class 'pandas.core.series.Series'>\n\na,b,c --> 인덱스\n1,2,3 --> 데이터 값\n"

## 문제1. 
## emp.csv를 pd.read_csv로 불러와서 emp 데이터 프레임으로 생성하고 empno의 타입을 확인하시오!

In [13]:
import pandas as pd

emp = pd.read_csv("d:\\data\\emp.csv")

print(emp)
print(type(emp))
print(emp['empno'])
print(type(emp['empno']))

    empno   ename        job     mgr    hiredate   sal    comm  deptno
0    7839    KING  PRESIDENT     NaN  1981-11-17  5000     NaN      10
1    7698   BLAKE    MANAGER  7839.0  1981-05-01  2850     NaN      30
2    7782   CLARK    MANAGER  7839.0  1981-05-09  2450     NaN      10
3    7566   JONES    MANAGER  7839.0  1981-04-01  2975     NaN      20
4    7654  MARTIN   SALESMAN  7698.0  1981-09-10  1250  1400.0      30
5    7499   ALLEN   SALESMAN  7698.0  1981-02-11  1600   300.0      30
6    7844  TURNER   SALESMAN  7698.0  1981-08-21  1500     0.0      30
7    7900   JAMES      CLERK  7698.0  1981-12-11   950     NaN      30
8    7521    WARD   SALESMAN  7698.0  1981-02-23  1250   500.0      30
9    7902    FORD    ANALYST  7566.0  1981-12-11  3000     NaN      20
10   7369   SMITH      CLERK  7902.0  1980-12-09   800     NaN      20
11   7788   SCOTT    ANALYST  7566.0  1982-12-22  3000     NaN      20
12   7876   ADAMS      CLERK  7788.0  1983-01-15  1100     NaN      20
13   7934  MILLER      CLERK  7782.0  1982-01-11  1300     NaN      10
<class 'pandas.core.frame.DataFrame'>
0     7839
1     7698
2     7782
3     7566
4     7654
5     7499
6     7844
7     7900
8     7521
9     7902
10    7369
11    7788
12    7876
13    7934
Name: empno, dtype: int64
<class 'pandas.core.series.Series'>

## ■ 2.2 판다스의 Series의 index와 values

시리즈 클래스의 index 속성을 이용하여 인덱스 배열만 따로 선택할 수 있다.

__문법 :__ Serise객체.index

시리즈 클래스의 values 속성을 이용하여 값 배열만 따로 선택할 수 있다.

__문법 :__ Series객체.values

In [17]:
# 예제1
import pandas as pd
list_data = ['2020-01-28', '3.14', 'ABC', 100, True] 
sr = pd.Series(list_data) # 리스트를 시리즈로 변환함
print(sr)
# sr 시리즈 객체에서 index를 추출
idx = sr.index
print(idx)
# sr 시리즈 객체에서 values를 추출
val = sr.values
print(val)

0    2020-01-28
1          3.14
2           ABC
3           100
4          True
dtype: object
RangeIndex(start=0, stop=5, step=1)
['2020-01-28' '3.14' 'ABC' 100 True]

## 문제2.
## ['scott', 'smith', 'allen', 'jones'] 리스트를 시리즈로 변환하고 index와 values를 각각 추출하시오.

In [18]:
import pandas as pd

list_data = ['scott', 'smith', 'allen', 'jones']
sr = pd.Series(list_data)

idx = sr.index
print(idx)

val = sr.values
print(val)

RangeIndex(start=0, stop=4, step=1)
['scott' 'smith' 'allen' 'jones']

## ■ 시리즈의 원소 선택

원소의 위치를 나타내는 주소 역활을 하는 인덱스를 이용하여 시리즈의 원소를 선택할 수 있다.   
하나의 원소를 선택할 수 있고, 여러개의 원소를 선택할 수도 있다.

In [2]:
# 예시
import pandas as pd

tup_data = ('영인', '2020-01-28', '여', True)
sr = pd.Series(tup_data, index = ['이름', '생년월일', '성별', '학생여부'])
print(sr, end = '\n\n')

print(sr['이름'], end = '\n\n') # 하나의 원소를 가져온다.

print(sr[['이름','생년월일']]) #여러개의 원소를 가져온다.

이름              영인
생년월일    2020-01-28
성별               여
학생여부          True
dtype: object

영인

이름              영인
생년월일    2020-01-28
dtype: object

## 문제3. ['scott', 'smith', 'allen', 'jones'] 리스트에 사원번호 [7788, 7902, 7369, 7566]을 인덱스 번호로 하여 시리즈를 구성하고 사원번호가 7902인 사원의 이름을 출력하시오.

In [172]:
import pandas as pd

list_data = ['scott', 'smith', 'allen', 'jones']
sr = pd.Series(list_data, index = [7788, 7902, 7369, 7566])

print(sr)
print(sr[7902])

7788    scott
7902    smith
7369    allen
7566    jones
dtype: object
smith

## ■ 판다스 데이터 프레임

판다스 데이터 프레임은 __2차원 배열__이다. 행과 열로 만들어지는 엑셀과 오라클과 같은 rdbms 등 다양한 분야에서 사용된다.  
판다스의 데이터 프레임 자료구조는 R의 데이터의 프레임에서 유래되었다.  
__시리즈__를 __열벡터(vector)__라고 하면, __데이터 프레임__은 열 벡터들이 같은 행 인덱스를 기준을 줄지어 결합된 __2차원 벡터 또는 행렬__이다.

In [29]:
import pandas as pd
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9]}
df = pd.DataFrame(dict_data) # <class 'pandas.core.frame.DataFrame'>
print(type(df))
print(df)

<class 'pandas.core.frame.DataFrame'>
   c0  c1  c2
0   1   4   7
1   2   5   8
2   3   6   9

## 문제4. 아래의 타이타닉 데이터 딕셔너리를 판다스 데이터 프레임으로 변환하시오!

참고 사이트 :  https://www.kaggle.com/c/titanic

- PassengerId : 승객 번호

- Survived : 생존여부(1: 생존, 0 : 사망) <--- 정답에 대한 (칼럼)

- Pclass : 승선권 클래스(1 : 1st, 2 : 2nd ,3 : 3rd)

- Name : 승객 이름

- Sex : 승객 성별

- Age : 승객 나이 

- SibSp : 동반한 형제자매, 배우자 수

- Patch : 동반한 부모, 자식 수

- Ticket : 티켓의 고유 넘버

- Fare 티켓의 요금

- Cabin : 객실 번호

- Embarked : 승선한 항구명(C : Cherbourg, Q : Queenstown, S : Southampton)

In [30]:
import pandas as pd
dict_data = {'PassengerId':[1,2,3], 'Survived':[0,1,1], 'Pclass':[3,1,3], 'age': [22,38,26]}
df = pd.DataFrame(dict_data)
print(df)

   PassengerId  Survived  Pclass  age
0            1         0       3   22
1            2         1       1   38
2            3         1       3   26

## 문제5. 타이타닉 훈련 데이터(train.csv)를 taitanic 변수에 로드하고 type를 확인하시오!

In [36]:
import pandas as pd
taitanic = pd.read_csv('d:\\data\\train.csv')
print(taitanic)
print(type(taitanic))

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]
<class 'pandas.core.frame.DataFrame'>

## 문제6. 타이타닉 데이터 프레임에서 컬럼명만 추출하시오!

In [37]:
import pandas as pd
taitanic = pd.read_csv('d:\\data\\train.csv')

print(taitanic.columns)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

## 문제7. 타이타닉 데이터 프레임에서 행 인덱스 이름을 추출하시오!

In [40]:
import pandas as pd
taitanic = pd.read_csv('d:\\data\\train.csv')

print(taitanic.index)
print(taitanic)

RangeIndex(start=0, stop=891, step=1)
     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

## 문제8. emp 데이터 프레임에서 컬럼명만 추출하시오.

In [41]:
import pandas as pd

emp = pd.read_csv('d:\\data\\emp.csv')
print(emp.columns)

Index(['empno', 'ename', 'job', 'mgr', 'hiredate', 'sal', 'comm', 'deptno'], dtype='object')

## 2.6 판다스 데이터 프레임의 행 인덱스/열 이름을 지정하는 방법

__문법 :__ pandas.DataFrame(2차원 배열, index = 행 인덱스 배열, columns = 열 이름 배열)

In [42]:
# 예제

df = pd.DataFrame([[15,'남','역삼중'], [17,'여','역삼중']], index = ['준서', '예은'], columns = ['나이', '성별', '학교'])
print(df)
# 준서, 예은 --> 행 인덱스 이름
# 나이, 성별, 학교 --> 열 이름

    나이 성별   학교
준서  15  남  역삼중
예은  17  여  역삼중

## 문제9. rename() 메소드를 이용하여 df의 열이름과 행이름을 아래와 같이 변경하시오!

['나이','성별','학교'] ----> ['연령','남녀','소속']  
[준서,예은] ----> [학생1, 학생2]

In [43]:
import pandas as pd
df = pd.DataFrame([[15,'남','역삼중'], [17,'여','역삼중']], index = ['준서', '예은'], columns = ['나이', '성별', '학교'])
df.rename(columns = {'나이' : '연령', '성별' : '남녀', '학교' : '소속'}, inplace = True)  
print(df)

    연령 남녀   소속
준서  15  남  역삼중
예은  17  여  역삼중

### ※ inplace = True 는 원본 객체를 직접 변경할 때 사용한다.
### ※ inplace = False 로 설정하면 새로운 객체가 생성되고, 원본객체는 변경없이 그대로 유지된다.
### ( drop 메소드 메소드 사용할때 유용함)

## 문제10. 행 인덱스 이름 변경을 위와 같이하시오.

In [44]:
import pandas as pd
df = pd.DataFrame([[15,'남','역삼중'], [17,'여','역삼중']], index = ['준서', '예은'], columns = ['나이', '성별', '학교'])
df.rename(index = {'준서' : '학생1', '예은' : '학생2'}, inplace = True)  
print(df)

     나이 성별   학교
학생1  15  남  역삼중
학생2  17  여  역삼중

## ■ 판다스 데이터 프레임에서 행/열 삭제 하는 방법

행과 열을 삭제하는 것은 __drop() 메소드__가 있다.

axis = 0 ---> 행삭제  
axis = 1 ---> 열삭제  

### 문법 : 
DataFrame 객체.drop( 행 인덱스 또는 배열, axis = 0)  <-- 행을삭제  
DataFrame 객체.drop( 열 이름 또는 배열, axis = 1) <-- 열을삭제

In [45]:
# 예제
import pandas as pd

exam_data = {'수학' : [90,80,70], '영어' : [98,89,95], '음악' : [85,95,100], '체육' : [100,90,90]}
df = pd.DataFrame(exam_data, index = ['서준', '우현', '인아'])
print(df)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

## 문제10. 위의 df 데이터 프레임을 df2로 복제하시오~

In [47]:
import pandas as pd
exam_data = {'수학' : [90,80,70], '영어' : [98,89,95], '음악' : [85,95,100], '체육' : [100,90,90]}
df = pd.DataFrame(exam_data, index = ['서준', '우현', '인아'])

df2 = df[:]
print(df2)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

## 문제11. 위의  복제한 df2 데이터 프레임에서 우현의 데이터를 삭제하시오~

In [173]:
import pandas as pd
exam_data = {'수학' : [90,80,70], '영어' : [98,89,95], '음악' : [85,95,100], '체육' : [100,90,90]}
df = pd.DataFrame(exam_data, index = ['서준', '우현', '인아'])

df2 = df[:]

# DataFrame객체.drop( 행 인덱스 또는 배열, axis = 0)

df2.drop('우현', axis=0, inplace = True)
print(df2)

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

C:\Users\wdp\Anaconda3\lib\site-packages\pandas\core\frame.py:4102: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

## 문제12. 데이터 프레임 df를 복제하여 df3에 저장하고 df3에서 우현과 인아 2개의 행을 삭제하시오!

In [49]:
import pandas as pd
exam_data = {'수학' : [90,80,70], '영어' : [98,89,95], '음악' : [85,95,100], '체육' : [100,90,90]}
df = pd.DataFrame(exam_data, index = ['서준', '우현', '인아'])

df3 = df[:]

df3.drop(['우현','인아'], axis =0, inplace = True) # 2개 이상의 행이나 열을 지우려고하면 []를 써주어야 한다.
print(df3)

    수학  영어  음악   체육
서준  90  98  85  100

## 점심시간 문제 : 직업이 SALESMAN인 사원들을 삭제하시오~

In [52]:
import pandas as pd
emp = pd.read_csv("d:\\data\\emp.csv", index_col = 'job')
# 행 인덱스 이름을 job 으로 지정하면서 데이터 프레임을 생성

emp2 = emp[:]
emp2.drop('SALESMAN', axis=0, inplace = True)

print(emp2)

           empno   ename     mgr    hiredate   sal  comm  deptno
job
PRESIDENT   7839    KING     NaN  1981-11-17  5000   NaN      10
MANAGER     7698   BLAKE  7839.0  1981-05-01  2850   NaN      30
MANAGER     7782   CLARK  7839.0  1981-05-09  2450   NaN      10
MANAGER     7566   JONES  7839.0  1981-04-01  2975   NaN      20
CLERK       7900   JAMES  7698.0  1981-12-11   950   NaN      30
ANALYST     7902    FORD  7566.0  1981-12-11  3000   NaN      20
CLERK       7369   SMITH  7902.0  1980-12-09   800   NaN      20
ANALYST     7788   SCOTT  7566.0  1982-12-22  3000   NaN      20
CLERK       7876   ADAMS  7788.0  1983-01-15  1100   NaN      20
CLERK       7934  MILLER  7782.0  1982-01-11  1300   NaN      10

## 문제13. 위의 복제된 df4 데이터 프레임에서 수학 컬럼을 삭제하시오~

In [3]:
import pandas as pd
exam_data = {'수학' : [90,80,70], '영어' : [98,89,95], '음악' : [85,95,100], '체육' : [100,90,90]}
df = pd.DataFrame(exam_data, index = ['서준', '우현', '인아'])

print(df, end = '\n\n')

df4 = df[:]
df4.drop('수학', axis=1, inplace = True)

print(df4)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

C:\Users\wdp\Anaconda3\lib\site-packages\pandas\core\frame.py:4102: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

## ■ 2.8 판다스 행 선택

데이터 프레임의 __행 데이터를 선택__하기 위해서는 __loc__와 __iloc__ 인덱스를 사용합니다.   
__인덱스 이름을 기준__으로 행을 선택할때는 __loc__를 이용하고    
__정수형 위치 인덱스__를 사용해서 행을 선택할 때는 __iloc__를 이용합니다.     

|    구분   |     loc     |         iloc         |
|:---------:|:-----------:|:--------------------:|
| 탐색 대상 | 인덱스 이름 |  정수형 위치 인덱스(숫자)  |
| 범위 지정 |    Series(범위의 끝도 포함)   | 기능(범위의 끝 제외) |

loc 예 : ['a':'c'] ---> 'a','b','c' (범위의 끝도 포함)  
iloc 예 : [3:7] ---> 3,4,5,6 (7은 제외)

## 문제14. 아래의 df데이터 프레임에서 서준의 데이터를 검색하시오.

In [174]:
import pandas as pd
exam_data = {'수학' : [90,80,70], '영어' : [98,89,95], '음악' : [85,95,100], '체육' : [100,90,90]}
df = pd.DataFrame(exam_data, index = ['서준', '우현', '인아'])
print(df)
print(df.loc['서준'])
print(df.iloc[0])

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90
수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64
수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

## 문제15.서준과 우현 학생의 전체 데이터를 가져오시오~

In [176]:
import pandas as pd
exam_data = {'수학' : [90,80,70], '영어' : [98,89,95], '음악' : [85,95,100], '체육' : [100,90,90]}
df = pd.DataFrame(exam_data, index = ['서준', '우현', '인아'])
print(df, end = '\n\n')
print(df.loc[['서준','우현']]) # 하나씩 일일히, 2개이상 지정 ([] 를 양쪽에 씌워주어야 한다.)
print(df.loc['서준':'우현']) # 범위로 지정 ([] 씌우면 안됨. 주의!!!)
print(df.iloc[[0,1]])
print(df.iloc[0:2])

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90
    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90
    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90
    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

## 문제16. 타이타닉 데이터에서 위의 5개의 행만 가져와서 출력하시오!

In [178]:
import pandas as pd
taitanic = pd.read_csv("d:\\data\\train.csv")
print(taitanic.iloc[0:6]) # iloc 이므로 끝부분 6은 포함안한다.
print(taitanic.head(), end = '\n\n') # head도 위에서 5개만 보도록 해준다.
print(taitanic.head(10)) # head(10)을 씀으로써 위에서 10개만 보도록 해준다.

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3
5            6         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0
5                                   Moran, Mr. James    male   NaN      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
5      0            330877   8.4583   NaN        Q
   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3
5            6         0       3
6            7         0       1
7            8         0       3
8            9         1       3
9           10         1       2

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0
5                                   Moran, Mr. James    male   NaN      0
6                            McCarthy, Mr. Timothy J    male  54.0      0
7                     Palsson, Master. Gosta Leonard    male   2.0      3
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
9                Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
5      0            330877   8.4583   NaN        Q
6      0             17463  51.8625   E46        S
7      1            349909  21.0750   NaN        S
8      2            347742  11.1333   NaN        S
9      0            237736  30.0708   NaN        C

## 문제17. 타이타닉 데이터의 맨 아래 5줄을 출력하시오!

In [71]:
# pandas 행 선택 : loc , iloc
import pandas as pd
tat = pd.read_csv("d:\\data\\train.csv")

print(tat.iloc[-5:])
print(tat.tail()) # tail 로도 표현이 가능함.

     PassengerId  Survived  Pclass                                      Name  \
886          887         0       2                     Montvila, Rev. Juozas
887          888         1       1              Graham, Miss. Margaret Edith
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"
889          890         1       1                     Behr, Mr. Karl Howell
890          891         0       3                       Dooley, Mr. Patrick

        Sex   Age  SibSp  Parch      Ticket   Fare Cabin Embarked
886    male  27.0      0      0      211536  13.00   NaN        S
887  female  19.0      0      0      112053  30.00   B42        S
888  female   NaN      1      2  W./C. 6607  23.45   NaN        S
889    male  26.0      0      0      111369  30.00  C148        C
890    male  32.0      0      0      370376   7.75   NaN        Q
     PassengerId  Survived  Pclass                                      Name  \
886          887         0       2                     Montvila, Rev. Juozas
887          888         1       1              Graham, Miss. Margaret Edith
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"
889          890         1       1                     Behr, Mr. Karl Howell
890          891         0       3                       Dooley, Mr. Patrick

        Sex   Age  SibSp  Parch      Ticket   Fare Cabin Embarked
886    male  27.0      0      0      211536  13.00   NaN        S
887  female  19.0      0      0      112053  30.00   B42        S
888  female   NaN      1      2  W./C. 6607  23.45   NaN        S
889    male  26.0      0      0      111369  30.00  C148        C
890    male  32.0      0      0      370376   7.75   NaN        Q

## ■ 판다스 열 선택

### 판다스에서 열이름을 선택하려면 ?

__1. 열 1개를 선택(시리즈 생성) :__ DataFrame 객체["열이름"] 또는 DataFrame 객체.열이름  
__2. 열 여러개를 선택(데이터 프레임 생성) :__ DataFrame 객체[[열1, 열2, 열3 ... , 열n]]

## 문제18. 아래의 데이터 프레임에서 수학 점수만 출력하시오!

In [4]:
import pandas as pd
exam_data = {'수학' : [90,80,70], '영어' : [98,89,95], '음악' : [85,95,100], '체육' : [100,90,90]}
df = pd.DataFrame(exam_data, index = ['서준', '우현', '인아'])
print(df, end = '\n\n')
print(df["수학"]) # DataFrame 객체["열이름"]   
print(df.수학) # DataFrame 객체.열이름

print(df[["수학", "영어"]]) # 열 여러개를 선택

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

서준    90
우현    80
인아    70
Name: 수학, dtype: int64
서준    90
우현    80
인아    70
Name: 수학, dtype: int64
    수학  영어
서준  90  98
우현  80  89
인아  70  95

## 문제19. 타이타닉 데이터에서 라벨이 되는 컬럼인 survived 컬럼만 조회해서 train_label 이라는 변수에 담고 출력하시오!

In [81]:
import pandas as pd
tat = pd.read_csv("d:\\data\\train.csv")
print(tat.columns) # 일단은 컬럼명부터 확인!

train_label = tat["Survived"]
print(train_label)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')
0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

## 문제20. 타이타닉 데이터에서 승객번호와 라벨(Survived) 두개를 한번에 조회하시오!

In [84]:
import pandas as pd
tat = pd.read_csv("d:\\data\\train.csv")
print(tat.columns) # 일단은 컬럼명부터 확인!

result = tat[["PassengerId", "Survived"]]
print(result)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')
     PassengerId  Survived
0              1         0
1              2         1
2              3         1
3              4         1
4              5         0
..           ...       ...
886          887         0
887          888         1
888          889         0
889          890         1
890          891         0

[891 rows x 2 columns]

## ■ 2.10 범위 슬라이싱의 고급활용

### DataFrame 객체.iloc[ 시작 인덱스 : 끝 인덱스 : 슬라이싱 간격 ]

슬라이싱 범위는 '시작 인덱스'를 포함하고 '끝 인덱스' 보다 1작은 인덱스까지 포함한다.  
'슬라이싱 간격'을 지정하지 않으면 1씩 증가한다.

## 문제21. 타이타닉 데이터를 출력하는데 2행 간격을 출력하시오!

In [179]:
# 행의 범위를 슬라이싱
import pandas as pd
tat = pd.read_csv("d:\\data\\train.csv")

print(tat.iloc[::2])

     PassengerId  Survived  Pclass  \
0              1         0       3
2              3         1       3
4              5         0       3
6              7         0       1
8              9         1       3
..           ...       ...     ...
882          883         0       3
884          885         0       3
886          887         0       2
888          889         0       3
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
4                             Allen, Mr. William Henry    male  35.0      0
6                              McCarthy, Mr. Timothy J    male  54.0      0
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
..                                                 ...     ...   ...    ...
882                       Dahlberg, Miss. Gerda Ulrika  female  22.0      0
884                             Sutehall, Mr. Henry Jr    male  25.0      0
886                              Montvila, Rev. Juozas    male  27.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
2        0  STON/O2. 3101282   7.9250   NaN        S
4        0            373450   8.0500   NaN        S
6        0             17463  51.8625   E46        S
8        2            347742  11.1333   NaN        S
..     ...               ...      ...   ...      ...
882      0              7552  10.5167   NaN        S
884      0   SOTON/OQ 392076   7.0500   NaN        S
886      0            211536  13.0000   NaN        S
888      2        W./C. 6607  23.4500   NaN        S
890      0            370376   7.7500   NaN        Q

[446 rows x 12 columns]

## 문제22. 타이타닉 데이터를 역순으로 출력하시오!

In [88]:
import pandas as pd
tat = pd.read_csv("d:\\data\\train.csv")
print(tat.iloc[::-1]) # 역순으로 나타내려면 간격만 -1로 바꾸어 주면 된다.

     PassengerId  Survived  Pclass  \
890          891         0       3
889          890         1       1
888          889         0       3
887          888         1       1
886          887         0       2
..           ...       ...     ...
4              5         0       3
3              4         1       1
2              3         1       3
1              2         1       1
0              1         0       3

                                                  Name     Sex   Age  SibSp  \
890                                Dooley, Mr. Patrick    male  32.0      0
889                              Behr, Mr. Karl Howell    male  26.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
887                       Graham, Miss. Margaret Edith  female  19.0      0
886                              Montvila, Rev. Juozas    male  27.0      0
..                                                 ...     ...   ...    ...
4                             Allen, Mr. William Henry    male  35.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
0                              Braund, Mr. Owen Harris    male  22.0      1

     Parch            Ticket     Fare Cabin Embarked
890      0            370376   7.7500   NaN        Q
889      0            111369  30.0000  C148        C
888      2        W./C. 6607  23.4500   NaN        S
887      0            112053  30.0000   B42        S
886      0            211536  13.0000   NaN        S
..     ...               ...      ...   ...      ...
4        0            373450   8.0500   NaN        S
3        0            113803  53.1000  C123        S
2        0  STON/O2. 3101282   7.9250   NaN        S
1        0          PC 17599  71.2833   C85        C
0        0         A/5 21171   7.2500   NaN        S

[891 rows x 12 columns]

## ■ 2.11 데이터 프레임에서 특정 원소를 선택하는 방법

데이터프레임의 행 인덱스와 열 이름을 [행,열] 형식의 2차원 좌표로 입력하여 원소 위치를 지정하는 방법

### 문법

__인덱스 이름 :__ DataFrame 객체.loc[행 인덱스, 열 이름]  
__정수 위치 인덱스 :__ DataFrame 객체.iloc[행 번호, 열 번호]

## 문제23. 아래의 데이터에서 서준의 음악점수를 출력하시오

In [180]:
import pandas as pd
exam_data = {'수학' : [90,80,70], '영어' : [98,89,95], '음악' : [85,95,100], '체육' : [100,90,90]}
df = pd.DataFrame(exam_data, index = ['서준', '우현', '인아'])

print(df, end = '\n\n')

print(df.loc["서준", "음악"]) 
# 행을 먼저 선택을 해야되기 때문에 loc나 iloc를 써야한다.
# "서준" --> 행 인덱스, "음악" --> 열 인덱스

print(df.iloc[0,2]) # 0 --> 행 번호, 2 --> 열 번호

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

85
85

## 문제24. 아래의 데이터에서 서준의 음악점수와 체육점수를 출력하시오!

In [182]:
import pandas as pd
exam_data = {'수학' : [90,80,70], '영어' : [98,89,95], '음악' : [85,95,100], '체육' : [100,90,90]}
df = pd.DataFrame(exam_data, index = ['서준', '우현', '인아'])

print(df, end = '\n\n')
print(df.loc["서준", ["음악", "체육"]], end = '\n\n')
print(df.loc["서준", "음악":"체육"])

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

음악     85
체육    100
Name: 서준, dtype: int64

음악     85
체육    100
Name: 서준, dtype: int64

## 문제25. 서준과 우현의 음악 점수와 체육점수를 출력하시오~~

In [103]:
import pandas as pd
exam_data = {'수학' : [90,80,70], '영어' : [98,89,95], '음악' : [85,95,100], '체육' : [100,90,90]}
df = pd.DataFrame(exam_data, index = ['서준', '우현', '인아'])

print(df.loc[["서준","우현"],["음악","체육"]])

    음악   체육
서준  85  100
우현  95   90

## ■ 2.12 컬럼 추가 (파생변수를 생성하기 위해 꼭 알아야할 내용)

__파생변수 :__ feature engineering

__타이타닉 -->__ " 여자와 아이 먼저 !! " (영화를 봐야 좋은 파생변수를 생성할 수 있다.

__문법 :__ DataFrame 객체['추가하려는 열 이름'] = 데이터 값

## 문제26. 아래의 데이터 프레임에 국어점수를 전부 80점으로 해서 컬럼을 추가하시오!

In [104]:
import pandas as pd
exam_data = {'수학' : [90,80,70], '영어' : [98,89,95], '음악' : [85,95,100], '체육' : [100,90,90]}
df = pd.DataFrame(exam_data, index = ['서준', '우현', '인아'])
df['국어'] = 80

print(df)

    수학  영어   음악   체육  국어
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80

## 문제27. 
## 타이타닉호 생존자와 사망자를 분류하는 모델에 좋은 학습 데이터를 제공하기 위해서 파생변수를 추가하시오~~
## tat 타이타닉 데이터 프레임에 age2 컬럼을 추가하고 age2를 기존나이의 제곱의 값으로 생성되게 하시오

In [109]:
import pandas as pd
tat = pd.read_csv("d:\\data\\train.csv")
tat['Age2'] = tat['Age'] ** 2

print(tat[['Age', 'Age2']])

      Age    Age2
0    22.0   484.0
1    38.0  1444.0
2    26.0   676.0
3    35.0  1225.0
4    35.0  1225.0
..    ...     ...
886  27.0   729.0
887  19.0   361.0
888   NaN     NaN
889  26.0   676.0
890  32.0  1024.0

[891 rows x 2 columns]

## 문제28. 타이타닉 데이터 프레임이 몇행 몇열로 되어있는지 확인하시오!

In [183]:
import pandas as pd
tat = pd.read_csv("d:\\data\\train.csv")

print(tat.shape) # shape를 이용하여 몇행 몇열인지를 알 수 있다.

(891, 12)

## ■ 2.13 행 추가

__" 데이터 프레임에 행을 추가하는 방법 "__

__문법 :__ DataFrame.loc['새로운 행 이름'] = 데이터값 (또는 배열)

In [111]:
# 행을 추가하여야 되기 때문에 loc가 붙는다.
import pandas as pd
exam_data = {'수학' : [90,80,70], '영어' : [98,89,95], '음악' : [85,95,100], '체육' : [100,90,90]}
df = pd.DataFrame(exam_data, index = ['서준', '우현', '인아'])

df.loc[3] = 0
print(df)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90
3    0   0    0    0

## 문제29. df 데이터 프레임을 아래와 같이 행을 추가하시오!

In [112]:
import pandas as pd
exam_data = {'수학' : [90,80,70], '영어' : [98,89,95], '음악' : [85,95,100], '체육' : [100,90,90]}
df = pd.DataFrame(exam_data, index = ['서준', '우현', '인아'])

df.loc['동규'] = [90,80,70,60]
print(df)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90
동규  90  80   70   60

## 문제30. 아래와 같이 인아의 행을 복사해서 맨 아래에 붙여 넣으시오.

In [185]:
import  pandas  as  pd 

exam_data = { '수학' : [ 90, 80, 70 ], '영어' : [98, 89, 95],
                '음악' :  [ 85, 95, 100], '체육' : [100, 90, 90] } 

df = pd.DataFrame( exam_data, index =['서준', '우현', '인아'] ) 
print (df, end = '\n\n')

df.loc['name'] = df.iloc[2]
print(df, end = '\n\n')

df.rename(index ={'name':'인아'} ,inplace=True)
print(df)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

      수학  영어   음악   체육
서준    90  98   85  100
우현    80  89   95   90
인아    70  95  100   90
name  70  95  100   90

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90
인아  70  95  100   90

## ■ 2.14 원소값 변경

데이터 프레임의 특정 원소를 선택하고 새로운 데이터 값을 지정해 주면 원소값이 변경된다.

__문법 :__ DataFrame 객체의 일부분 또는 원소를 선택 = 새로운 값

## 문제31. 아래의 서준의 체육점수를 100점에서 80점으로 변경하시오!

In [115]:
import pandas as pd
exam_data = {'수학' : [90,80,70], '영어' : [98,89,95], '음악' : [85,95,100], '체육' : [100,90,90]}
df = pd.DataFrame(exam_data, index = ['서준', '우현', '인아'])

df.loc['서준']['체육'] = 80 # '서준' = 행 , '체육' = 열
print(df)

    수학  영어   음악  체육
서준  90  98   85  80
우현  80  89   95  90
인아  70  95  100  90

In [187]:
import pandas as pd

exam_data = {'이름' : ['서준', '우현', '인아'], '수학' : [90,80,70], '영어' : [98,89,95], '음악' : [85,95,100], '체육' : [100,90,90]}
df = pd.DataFrame(exam_data) # index를 ['서준', '우현', '인아'] 로 설정안함!
print(df)

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

### * '이름' 열을 새로운 인덱스로 지정하고 df 객체에 변경사항을 반영

DataFrame 객체.set_index('열이름', inplace = True)

In [186]:
import pandas as pd

exam_data = {'이름' : ['서준', '우현', '인아'], '수학' : [90,80,70], '영어' : [98,89,95], '음악' : [85,95,100], '체육' : [100,90,90]}
df = pd.DataFrame(exam_data)
df.set_index('이름', inplace = True)
print(df, end = '\n\n')

df.loc['서준']['체육'] = 80
print(df)

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

    수학  영어   음악  체육
이름
서준  90  98   85  80
우현  80  89   95  90
인아  70  95  100  90

## ■ 2.15 데이터 프레임의 행과 열의 위치를 변경하기

In [120]:
import pandas as pd

exam_data = {'이름' : ['서준', '우현', '인아'], '수학' : [90,80,70], '영어' : [98,89,95], '음악' : [85,95,100], '체육' : [100,90,90]}
df = pd.DataFrame(exam_data)
print(df)

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

## 문제32. 위의 행을 열로 변경하고 열을 행으로 변경하시오!

In [188]:
import pandas as pd

exam_data = {'이름' : ['서준', '우현', '인아'], '수학' : [90,80,70], '영어' : [98,89,95], '음악' : [85,95,100], '체육' : [100,90,90]}
print(df, end = '\n\n')

df = pd.DataFrame(exam_data)
df = df.transpose() # 또는 df.T
print(df)

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

      0   1    2
이름   서준  우현   인아
수학   90  80   70
영어   98  89   95
음악   85  95  100
체육  100  90   90

In [123]:
import pandas as pd

exam_data = {'이름' : ['서준', '우현', '인아'], '수학' : [90,80,70], '영어' : [98,89,95], '음악' : [85,95,100], '체육' : [100,90,90]}
df = pd.DataFrame(exam_data)
df = df.T
print(df)

      0   1    2
이름   서준  우현   인아
수학   90  80   70
영어   98  89   95
음악   85  95  100
체육  100  90   90

## ■ 2.16 결측치 (NaN) 확인하기

__" emp 데이터 프레임에 결측치가 있는지 확인하는 방법 "__

In [127]:
import pandas as pd

emp = pd.read_csv("d:\\data\\emp.csv")
print(emp.isnull()) 
# True --> Nan값
# False --> Nan값이 아님.

    empno  ename    job    mgr  hiredate    sal   comm  deptno
0   False  False  False   True     False  False   True   False
1   False  False  False  False     False  False   True   False
2   False  False  False  False     False  False   True   False
3   False  False  False  False     False  False   True   False
4   False  False  False  False     False  False  False   False
5   False  False  False  False     False  False  False   False
6   False  False  False  False     False  False  False   False
7   False  False  False  False     False  False   True   False
8   False  False  False  False     False  False  False   False
9   False  False  False  False     False  False   True   False
10  False  False  False  False     False  False   True   False
11  False  False  False  False     False  False   True   False
12  False  False  False  False     False  False   True   False
13  False  False  False  False     False  False   True   False

## 문제33. emp 테이블에 comm에 결측치의 토탈값을 구하시오!

In [6]:
import pandas as pd

emp = pd.read_csv("d:\\data\\emp.csv")
print(emp.isnull(), end = '\n\n') 

print(sum(emp['comm'].isnull())) #10
print(emp['comm'].isnull().sum(), end = '\n\n') #10

print(emp.isnull().sum(), end = '\n\n')

print(emp.isnull().sum()[:1])
# True = 1
# False = 0 으로 인식

    empno  ename    job    mgr  hiredate    sal   comm  deptno
0   False  False  False   True     False  False   True   False
1   False  False  False  False     False  False   True   False
2   False  False  False  False     False  False   True   False
3   False  False  False  False     False  False   True   False
4   False  False  False  False     False  False  False   False
5   False  False  False  False     False  False  False   False
6   False  False  False  False     False  False  False   False
7   False  False  False  False     False  False   True   False
8   False  False  False  False     False  False  False   False
9   False  False  False  False     False  False   True   False
10  False  False  False  False     False  False   True   False
11  False  False  False  False     False  False   True   False
12  False  False  False  False     False  False   True   False
13  False  False  False  False     False  False   True   False

10
10

empno        0
ename        0
job          0
mgr          1
hiredate     0
sal          0
comm        10
deptno       0
dtype: int64

empno    0
dtype: int64

## 문제34. emp 데이터 프레임에 커미션이 null인 사원들의 데이터를 0으로 변경하시오!

In [142]:
import pandas as pd
emp = pd.read_csv("d:\\data\\emp.csv")
emp['comm'] = emp['comm'].fillna(0)
print(emp)

    empno   ename        job     mgr    hiredate   sal    comm  deptno
0    7839    KING  PRESIDENT     NaN  1981-11-17  5000     0.0      10
1    7698   BLAKE    MANAGER  7839.0  1981-05-01  2850     0.0      30
2    7782   CLARK    MANAGER  7839.0  1981-05-09  2450     0.0      10
3    7566   JONES    MANAGER  7839.0  1981-04-01  2975     0.0      20
4    7654  MARTIN   SALESMAN  7698.0  1981-09-10  1250  1400.0      30
5    7499   ALLEN   SALESMAN  7698.0  1981-02-11  1600   300.0      30
6    7844  TURNER   SALESMAN  7698.0  1981-08-21  1500     0.0      30
7    7900   JAMES      CLERK  7698.0  1981-12-11   950     0.0      30
8    7521    WARD   SALESMAN  7698.0  1981-02-23  1250   500.0      30
9    7902    FORD    ANALYST  7566.0  1981-12-11  3000     0.0      20
10   7369   SMITH      CLERK  7902.0  1980-12-09   800     0.0      20
11   7788   SCOTT    ANALYST  7566.0  1982-12-22  3000     0.0      20
12   7876   ADAMS      CLERK  7788.0  1983-01-15  1100     0.0      20
13   7934  MILLER      CLERK  7782.0  1982-01-11  1300     0.0      10

## ■ 2.17 특정 칼럼을 기준으로 데이터를 정렬하는 방법

__문법 :__ df_sort = df.sort_values(by = '특정 컬럼명', ascending = False)

## 문제34. 사원 데이터 프레임을 출력하는데 월급이 높은 사원부터 출력되게 하시오!

In [190]:
import pandas as pd

emp = pd.read_csv("d:\\data\\emp.csv")
print(emp, end = '\n\n') # 정렬전

emp_sort = emp.sort_values(by = 'sal', ascending = False) # 내림차순 정렬
print(emp_sort) #정렬후

    empno   ename        job     mgr    hiredate   sal    comm  deptno
0    7839    KING  PRESIDENT     NaN  1981-11-17  5000     NaN      10
1    7698   BLAKE    MANAGER  7839.0  1981-05-01  2850     NaN      30
2    7782   CLARK    MANAGER  7839.0  1981-05-09  2450     NaN      10
3    7566   JONES    MANAGER  7839.0  1981-04-01  2975     NaN      20
4    7654  MARTIN   SALESMAN  7698.0  1981-09-10  1250  1400.0      30
5    7499   ALLEN   SALESMAN  7698.0  1981-02-11  1600   300.0      30
6    7844  TURNER   SALESMAN  7698.0  1981-08-21  1500     0.0      30
7    7900   JAMES      CLERK  7698.0  1981-12-11   950     NaN      30
8    7521    WARD   SALESMAN  7698.0  1981-02-23  1250   500.0      30
9    7902    FORD    ANALYST  7566.0  1981-12-11  3000     NaN      20
10   7369   SMITH      CLERK  7902.0  1980-12-09   800     NaN      20
11   7788   SCOTT    ANALYST  7566.0  1982-12-22  3000     NaN      20
12   7876   ADAMS      CLERK  7788.0  1983-01-15  1100     NaN      20
13   7934  MILLER      CLERK  7782.0  1982-01-11  1300     NaN      10

    empno   ename        job     mgr    hiredate   sal    comm  deptno
0    7839    KING  PRESIDENT     NaN  1981-11-17  5000     NaN      10
9    7902    FORD    ANALYST  7566.0  1981-12-11  3000     NaN      20
11   7788   SCOTT    ANALYST  7566.0  1982-12-22  3000     NaN      20
3    7566   JONES    MANAGER  7839.0  1981-04-01  2975     NaN      20
1    7698   BLAKE    MANAGER  7839.0  1981-05-01  2850     NaN      30
2    7782   CLARK    MANAGER  7839.0  1981-05-09  2450     NaN      10
5    7499   ALLEN   SALESMAN  7698.0  1981-02-11  1600   300.0      30
6    7844  TURNER   SALESMAN  7698.0  1981-08-21  1500     0.0      30
13   7934  MILLER      CLERK  7782.0  1982-01-11  1300     NaN      10
4    7654  MARTIN   SALESMAN  7698.0  1981-09-10  1250  1400.0      30
8    7521    WARD   SALESMAN  7698.0  1981-02-23  1250   500.0      30
12   7876   ADAMS      CLERK  7788.0  1983-01-15  1100     NaN      20
7    7900   JAMES      CLERK  7698.0  1981-12-11   950     NaN      30
10   7369   SMITH      CLERK  7902.0  1980-12-09   800     NaN      20

## 문제35. 위의 결과를 다시 출력하는데 이름과 월급만 출력하시오! (loc를 사용하세요)

In [195]:
import pandas as pd

emp = pd.read_csv("d:\\data\\emp.csv")
print(emp, end = '\n\n') # 정렬전

emp = emp.loc[:, ['ename','sal']].sort_values(by = 'sal', ascending = False)
print(emp)

    empno   ename        job     mgr    hiredate   sal    comm  deptno
0    7839    KING  PRESIDENT     NaN  1981-11-17  5000     NaN      10
1    7698   BLAKE    MANAGER  7839.0  1981-05-01  2850     NaN      30
2    7782   CLARK    MANAGER  7839.0  1981-05-09  2450     NaN      10
3    7566   JONES    MANAGER  7839.0  1981-04-01  2975     NaN      20
4    7654  MARTIN   SALESMAN  7698.0  1981-09-10  1250  1400.0      30
5    7499   ALLEN   SALESMAN  7698.0  1981-02-11  1600   300.0      30
6    7844  TURNER   SALESMAN  7698.0  1981-08-21  1500     0.0      30
7    7900   JAMES      CLERK  7698.0  1981-12-11   950     NaN      30
8    7521    WARD   SALESMAN  7698.0  1981-02-23  1250   500.0      30
9    7902    FORD    ANALYST  7566.0  1981-12-11  3000     NaN      20
10   7369   SMITH      CLERK  7902.0  1980-12-09   800     NaN      20
11   7788   SCOTT    ANALYST  7566.0  1982-12-22  3000     NaN      20
12   7876   ADAMS      CLERK  7788.0  1983-01-15  1100     NaN      20
13   7934  MILLER      CLERK  7782.0  1982-01-11  1300     NaN      10

     ename   sal
0     KING  5000
9     FORD  3000
11   SCOTT  3000
3    JONES  2975
1    BLAKE  2850
2    CLARK  2450
5    ALLEN  1600
6   TURNER  1500
13  MILLER  1300
4   MARTIN  1250
8     WARD  1250
12   ADAMS  1100
7    JAMES   950
10   SMITH   800

## 문제36. 타이타닉 데이터에서 나이가 가장 많은 사람순으로 데이터를 정렬해서 이름과 나이와 생존여부를 출력하는데 위에 10명만 출력하시오!

In [10]:
import pandas as pd
tat = pd.read_csv("d:\\data\\train.csv")
tat_sort = tat.sort_values(by = 'Age', ascending=False)
print(tat_sort[['Name','Age','Survived']][:10], end = '\n\n')

                                     Name   Age  Survived
630  Barkworth, Mr. Algernon Henry Wilson  80.0         1
851                   Svensson, Mr. Johan  74.0         0
493               Artagaveytia, Mr. Ramon  71.0         0
96              Goldschmidt, Mr. George B  71.0         0
116                  Connors, Mr. Patrick  70.5         0
672           Mitchell, Mr. Henry Michael  70.0         0
745          Crosby, Capt. Edward Gifford  70.0         0
33                  Wheadon, Mr. Edward H  66.0         0
54         Ostby, Mr. Engelhart Cornelius  65.0         0
280                      Duane, Mr. Frank  65.0         0

                                     Name    Age  Survived
630  Barkworth, Mr. Algernon Henry Wilson  80.00         1
851                   Svensson, Mr. Johan  74.00         0
493               Artagaveytia, Mr. Ramon  71.00         0
96              Goldschmidt, Mr. George B  71.00         0
116                  Connors, Mr. Patrick  70.50         0
..                                    ...    ...       ...
644                Baclini, Miss. Eugenie   0.75         1
469         Baclini, Miss. Helene Barbara   0.75         1
755             Hamalainen, Master. Viljo   0.67         1
803       Thomas, Master. Assad Alexander   0.42         1
5                        Moran, Mr. James    NaN         0

[715 rows x 3 columns]

In [164]:
import pandas as pd
tat = pd.read_csv("d:\\data\\train.csv")

tat_sort = tat.sort_values(by = 'Age', ascending = False)

print(tat_sort[['Name', 'Age', 'Survived']].head(10))

                                     Name   Age  Survived
630  Barkworth, Mr. Algernon Henry Wilson  80.0         1
851                   Svensson, Mr. Johan  74.0         0
493               Artagaveytia, Mr. Ramon  71.0         0
96              Goldschmidt, Mr. George B  71.0         0
116                  Connors, Mr. Patrick  70.5         0
672           Mitchell, Mr. Henry Michael  70.0         0
745          Crosby, Capt. Edward Gifford  70.0         0
33                  Wheadon, Mr. Edward H  66.0         0
54         Ostby, Mr. Engelhart Cornelius  65.0         0
280                      Duane, Mr. Frank  65.0         0

## 문제37. 타이타닉 데이터에서 각 컬럼들의 결측치가 가장 많은 컬럼이 무엇인지 출력하시오!
## (오늘의 마지막 문제)

In [206]:
import pandas as pd

tat = pd.read_csv("d:\\data\\train.csv")
tat1 = tat.isnull().sum().sort_values(ascending=False)

print(tat.isnull().sum().sort_values(ascending=False).head(1), end = '\n\n')
print(tat1[:1])

Cabin    687
dtype: int64

Cabin    687
dtype: int64